---
kind: property
id: P:Autodesk.Revit.DB.Electrical.PanelScheduleTemplate.IsDefault
source: html/06c3a815-be62-eb35-d3cd-cda4e948adbf.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleTemplate.IsDefault Property

Checks to see if this is default template for the given panel schedule type.

## Syntax (C#)
```csharp
public bool IsDefault { get; }
```